DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
/*
 * Copyright (C) 2018-2023, STMicroelectronics - All Rights Reserved
 *
 * SPDX-License-Identifier: GPL-2.0+ OR BSD-3-Clause
 */

#include <assert.h>
#include <errno.h>
#include <limits.h>
#include <stdint.h>

#include <common/fdt_wrappers.h>
#include <drivers/clk.h>
#include <drivers/delay_timer.h>
#include <drivers/generic_delay_timer.h>
#include <drivers/st/stm32mp_clkfunc.h>
#include <drivers/st/stm32mp2_clk.h>
#include <libfdt.h>
#include <lib/mmio.h>
#include <lib/spinlock.h>
#include <lib/utils_def.h>

#include <platform_def.h>
#include "clk-stm32-core.h"

struct stm32_osci_dt_cfg {
	unsigned long freq;
	uint32_t drive;
	bool bypass;
	bool digbyp;
	bool css;
};

struct stm32_pll_dt_cfg {
	uint32_t src;
	uint32_t frac;
	uint32_t cfg[PLLCFG_NB];
	uint32_t csg[PLLCSG_NB];
	bool csg_enabled;
	bool enabled;
};

struct stm32_clk_platdata {
	uintptr_t rcc_base;
	uint32_t nosci;
	struct stm32_osci_dt_cfg *osci;
	uint32_t npll;
	struct stm32_pll_dt_cfg *pll;
	uint32_t nflexgen;
	uint32_t *flexgen;
	uint32_t nbusclk;
	uint32_t *busclk;
	uint32_t nkernelclk;
	uint32_t *kernelclk;
};

/* A35 Sub-System which manages its own PLL (PLL1) */
#define A35_SS_CHGCLKREQ	0x0000
#define A35_SS_PLL_FREQ1	0x0080
#define A35_SS_PLL_FREQ2	0x0090
#define A35_SS_PLL_ENABLE	0x00a0

#define A35_SS_CHGCLKREQ_ARM_CHGCLKREQ		BIT(0)
#define A35_SS_CHGCLKREQ_ARM_CHGCLKACK		BIT(1)

#define A35_SS_PLL_FREQ1_FBDIV_MASK		GENMASK(11, 0)
#define A35_SS_PLL_FREQ1_FBDIV_SHIFT		0
#define A35_SS_PLL_FREQ1_REFDIV_MASK		GENMASK(21, 16)
#define A35_SS_PLL_FREQ1_REFDIV_SHIFT		16

#define A35_SS_PLL_FREQ2_POSTDIV1_MASK		GENMASK(2, 0)
#define A35_SS_PLL_FREQ2_POSTDIV1_SHIFT		0
#define A35_SS_PLL_FREQ2_POSTDIV2_MASK		GENMASK(5, 3)
#define A35_SS_PLL_FREQ2_POSTDIV2_SHIFT		3

#define A35_SS_PLL_ENABLE_PD			BIT(0)
#define A35_SS_PLL_ENABLE_LOCKP			BIT(1)
#define A35_SS_PLL_ENABLE_NRESET_SWPLL_FF	BIT(2)

#define TIMEOUT_US_200MS	U(200000)
#define TIMEOUT_US_1S		U(1000000)

#define PLLRDY_TIMEOUT		TIMEOUT_US_200MS
#define CLKSRC_TIMEOUT		TIMEOUT_US_200MS
#define CLKDIV_TIMEOUT		TIMEOUT_US_200MS
#define OSCRDY_TIMEOUT		TIMEOUT_US_1S

/* PLL minimal frequencies for clock sources */
#define PLL_REFCLK_MIN			UL(5000000)
#define PLL_FRAC_REFCLK_MIN		UL(10000000)

#define XBAR_CHANNEL_NB			64

/* Warning, should be start to 1 */
enum clock {
	_CK_0_MHZ,

	/* ROOT CLOCKS */
	_CK_HSI,
	_CK_HSE,
	_CK_MSI,
	_CK_LSI,
	_CK_LSE,
	_I2SCKIN,
	_SPDIFSYMB,
	_CK_PLL1,
	_CK_PLL2,
	_CK_PLL3,
	_CK_PLL4,
	_CK_PLL5,
	_CK_PLL6,
	_CK_PLL7,
	_CK_PLL8,
	_CK_HSE_RTC,
	_CK_RTCCK,
	_CK_ICN_HS_MCU,
	_CK_ICN_SDMMC,
	_CK_ICN_DDR,
	_CK_ICN_HSL,
	_CK_ICN_NIC,
	_CK_ICN_LS_MCU,
	_CK_FLEXGEN_07,
	_CK_FLEXGEN_08,
	_CK_FLEXGEN_09,
	_CK_FLEXGEN_10,
	_CK_FLEXGEN_11,
	_CK_FLEXGEN_12,
	_CK_FLEXGEN_13,
	_CK_FLEXGEN_14,
	_CK_FLEXGEN_15,
	_CK_FLEXGEN_16,
	_CK_FLEXGEN_17,
	_CK_FLEXGEN_18,
	_CK_FLEXGEN_19,
	_CK_FLEXGEN_20,
	_CK_FLEXGEN_21,
	_CK_FLEXGEN_22,
	_CK_FLEXGEN_23,
	_CK_FLEXGEN_24,
	_CK_FLEXGEN_25,
	_CK_FLEXGEN_26,
	_CK_FLEXGEN_27,
	_CK_FLEXGEN_28,
	_CK_FLEXGEN_29,
	_CK_FLEXGEN_30,
	_CK_FLEXGEN_31,
	_CK_FLEXGEN_32,
	_CK_FLEXGEN_33,
	_CK_FLEXGEN_34,
	_CK_FLEXGEN_35,
	_CK_FLEXGEN_36,
	_CK_FLEXGEN_37,
	_CK_FLEXGEN_38,
	_CK_FLEXGEN_39,
	_CK_FLEXGEN_40,
	_CK_FLEXGEN_41,
	_CK_FLEXGEN_42,
	_CK_FLEXGEN_43,
	_CK_FLEXGEN_44,
	_CK_FLEXGEN_45,
	_CK_FLEXGEN_46,
	_CK_FLEXGEN_47,
	_CK_FLEXGEN_48,
	_CK_FLEXGEN_49,
	_CK_FLEXGEN_50,
	_CK_FLEXGEN_51,
	_CK_FLEXGEN_52,
	_CK_FLEXGEN_53,
	_CK_FLEXGEN_54,
	_CK_FLEXGEN_55,
	_CK_FLEXGEN_56,
	_CK_FLEXGEN_57,
	_CK_FLEXGEN_58,
	_CK_FLEXGEN_59,
	_CK_FLEXGEN_60,
	_CK_FLEXGEN_61,
	_CK_FLEXGEN_62,
	_CK_FLEXGEN_63,
	_CK_ICN_APB1,
	_CK_ICN_APB2,
	_CK_ICN_APB3,
	_CK_ICN_APB4,
	_CK_ICN_APBDBG,
	_CK_BKPSRAM,
	_CK_BSEC,
	_CK_CRC,
	_CK_CRYP1,
	_CK_CRYP2,
	_CK_DDR,
	_CK_DDRCAPB,
	_CK_DDRCP,
	_CK_DDRPHYC,
	_CK_FMC,
	_CK_GPIOA,
	_CK_GPIOB,
	_CK_GPIOC,
	_CK_GPIOD,
	_CK_GPIOE,
	_CK_GPIOF,
	_CK_GPIOG,
	_CK_GPIOH,
	_CK_GPIOI,
	_CK_GPIOJ,
	_CK_GPIOK,
	_CK_GPIOZ,
	_CK_HASH,
	_CK_I2C1,
	_CK_I2C2,
	_CK_I2C3,
	_CK_I2C4,
	_CK_I2C5,
	_CK_I2C6,
	_CK_I2C7,
	_CK_I2C8,
	_CK_IWDG1,
	_CK_IWDG2,
	_CK_OSPI1,
	_CK_OSPI2,
	_CK_OSPIIOM,
	_CK_PKA,
	_CK_RETRAM,
	_CK_RNG,
	_CK_RTC,
	_CK_SAES,
	_CK_SDMMC1,
	_CK_SDMMC2,
	_CK_SRAM1,
	_CK_SRAM2,
	_CK_STGEN,
	_CK_SYSCPU1,
	_CK_SYSRAM,
	_CK_UART4,
	_CK_UART5,
	_CK_UART7,
	_CK_UART8,
	_CK_UART9,
	_CK_USART1,
	_CK_USART2,
	_CK_USART3,
	_CK_USART6,
	_CK_USB2EHCI,
	_CK_USB2OHCI,
	_CK_USB2PHY1,
	_CK_USB2PHY2,
	_CK_USB3DR,
	_CK_USB3PCIEPHY,
	_CK_USBTC,

	CK_LAST
};

static const uint16_t muxsel_src[] = {
	_CK_HSI, _CK_HSE, _CK_MSI, _CK_0_MHZ
};

static const uint16_t xbarsel_src[] = {
	_CK_PLL4, _CK_PLL5, _CK_PLL6, _CK_PLL7, _CK_PLL8,
	_CK_HSI, _CK_HSE, _CK_MSI, _CK_HSI, _CK_HSE, _CK_MSI,
	_SPDIFSYMB, _I2SCKIN, _CK_LSI, _CK_LSE
};

static const uint16_t rtc_src[] = {
	_CK_0_MHZ, _CK_LSE, _CK_LSI, _CK_HSE_RTC
};

static const uint16_t usb2phy1_src[] = {
	_CK_FLEXGEN_57, _CK_HSE
};

static const uint16_t usb2phy2_src[] = {
	_CK_FLEXGEN_58, _CK_HSE
};

static const uint16_t usb3pciphy_src[] = {
	_CK_FLEXGEN_34, _CK_HSE
};

static const uint16_t d3per_src[] = {
	_CK_MSI, _CK_LSI, _CK_LSE
};

#undef MUX_CFG
#define MUX_CFG(id, src, _offset, _shift, _witdh)[id] = {\
	.id_parents	= src,\
	.num_parents	= ARRAY_SIZE(src),\
	.mux		= &(struct mux_cfg) {\
		.offset	= (_offset),\
		.shift	= (_shift),\
		.width	= (_witdh),\
		.bitrdy = UINT8_MAX,\
	},\
}

static const struct parent_cfg parent_mp25[] = {
	MUX_CFG(MUX_MUXSEL0, muxsel_src, RCC_MUXSELCFGR, 0, 2),
	MUX_CFG(MUX_MUXSEL1, muxsel_src, RCC_MUXSELCFGR, 4, 2),
	MUX_CFG(MUX_MUXSEL2, muxsel_src, RCC_MUXSELCFGR, 8, 2),
	MUX_CFG(MUX_MUXSEL3, muxsel_src, RCC_MUXSELCFGR, 12, 2),
	MUX_CFG(MUX_MUXSEL4, muxsel_src, RCC_MUXSELCFGR, 16, 2),
	MUX_CFG(MUX_MUXSEL5, muxsel_src, RCC_MUXSELCFGR, 20, 2),
	MUX_CFG(MUX_MUXSEL6, muxsel_src, RCC_MUXSELCFGR, 24, 2),
	MUX_CFG(MUX_MUXSEL7, muxsel_src, RCC_MUXSELCFGR, 28, 2),
	MUX_CFG(MUX_XBARSEL, xbarsel_src, RCC_XBAR0CFGR, 0, 4),
	MUX_CFG(MUX_RTC, rtc_src, RCC_BDCR, 16, 2),
	MUX_CFG(MUX_USB2PHY1, usb2phy1_src, RCC_USB2PHY1CFGR, 15, 1),
	MUX_CFG(MUX_USB2PHY2, usb2phy2_src, RCC_USB2PHY2CFGR, 15, 1),
	MUX_CFG(MUX_USB3PCIEPHY, usb3pciphy_src, RCC_USB3PCIEPHYCFGR, 15, 1),
	MUX_CFG(MUX_D3PER, d3per_src, RCC_D3DCR, 16, 2),
};

/* GATES */
enum enum_gate_cfg {
	GATE_ZERO, /* reserved for no gate */
	GATE_LSE,
	GATE_RTCCK,
	GATE_LSI,
	GATE_HSI,
	GATE_MSI,
	GATE_HSE,
	GATE_LSI_RDY,
	GATE_MSI_RDY,
	GATE_LSE_RDY,
	GATE_HSE_RDY,
	GATE_HSI_RDY,
	GATE_SYSRAM,
	GATE_RETRAM,
	GATE_SRAM1,
	GATE_SRAM2,

	GATE_DDRPHYC,
	GATE_SYSCPU1,
	GATE_CRC,
	GATE_OSPIIOM,
	GATE_BKPSRAM,
	GATE_HASH,
	GATE_RNG,
	GATE_CRYP1,
	GATE_CRYP2,
	GATE_SAES,
	GATE_PKA,

	GATE_GPIOA,
	GATE_GPIOB,
	GATE_GPIOC,
	GATE_GPIOD,
	GATE_GPIOE,
	GATE_GPIOF,
	GATE_GPIOG,
	GATE_GPIOH,
	GATE_GPIOI,
	GATE_GPIOJ,
	GATE_GPIOK,
	GATE_GPIOZ,
	GATE_RTC,

	GATE_DDRCP,

	/* WARNING 2 CLOCKS FOR ONE GATE */
	GATE_USB2OHCI,
	GATE_USB2EHCI,

	GATE_USB3DR,

