DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
	return NULL;
}
#endif

enum pll_id {
	_PLL1,
	_PLL2,
	_PLL3,
	_PLL4,
	_PLL5,
	_PLL6,
	_PLL7,
	_PLL8,
	_PLL_NB
};

/* PLL configuration registers offsets from RCC_PLLxCFGR1 */
#define RCC_OFFSET_PLLXCFGR1		0x00
#define RCC_OFFSET_PLLXCFGR2		0x04
#define RCC_OFFSET_PLLXCFGR3		0x08
#define RCC_OFFSET_PLLXCFGR4		0x0C
#define RCC_OFFSET_PLLXCFGR5		0x10
#define RCC_OFFSET_PLLXCFGR6		0x18
#define RCC_OFFSET_PLLXCFGR7		0x1C

struct stm32_clk_pll {
	uint16_t clk_id;
	uint16_t reg_pllxcfgr1;
};

#define CLK_PLL_CFG(_idx, _clk_id, _reg)\
	[(_idx)] = {\
		.clk_id = (_clk_id),\
		.reg_pllxcfgr1 = (_reg),\
	}

static const struct stm32_clk_pll stm32mp25_clk_pll[_PLL_NB] = {
	CLK_PLL_CFG(_PLL1, _CK_PLL1, A35_SS_CHGCLKREQ),
	CLK_PLL_CFG(_PLL2, _CK_PLL2, RCC_PLL2CFGR1),
	CLK_PLL_CFG(_PLL3, _CK_PLL3, RCC_PLL3CFGR1),
	CLK_PLL_CFG(_PLL4, _CK_PLL4, RCC_PLL4CFGR1),
	CLK_PLL_CFG(_PLL5, _CK_PLL5, RCC_PLL5CFGR1),
	CLK_PLL_CFG(_PLL6, _CK_PLL6, RCC_PLL6CFGR1),
	CLK_PLL_CFG(_PLL7, _CK_PLL7, RCC_PLL7CFGR1),
	CLK_PLL_CFG(_PLL8, _CK_PLL8, RCC_PLL8CFGR1),
};

static const struct stm32_clk_pll *clk_stm32_pll_data(unsigned int idx)
{
	return &stm32mp25_clk_pll[idx];
}

static unsigned long clk_get_pll_fvco(struct stm32_clk_priv *priv,
				      const struct stm32_clk_pll *pll,
				      unsigned long prate)
{
	unsigned long refclk, fvco;
	uint32_t fracin, fbdiv, refdiv;
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uintptr_t pllxcfgr2 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR2;
	uintptr_t pllxcfgr3 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR3;

	refclk = prate;

	fracin = mmio_read_32(pllxcfgr3) & RCC_PLLxCFGR3_FRACIN_MASK;
	fbdiv = (mmio_read_32(pllxcfgr2) & RCC_PLLxCFGR2_FBDIV_MASK) >>
		RCC_PLLxCFGR2_FBDIV_SHIFT;
	refdiv = mmio_read_32(pllxcfgr2) & RCC_PLLxCFGR2_FREFDIV_MASK;

	if (fracin != 0U) {
		unsigned long long numerator, denominator;

		numerator = ((unsigned long long)fbdiv << 24) + fracin;
		numerator = refclk * numerator;
		denominator = (unsigned long long)refdiv << 24;
		fvco = (unsigned long)(numerator / denominator);
	} else {
		fvco = (unsigned long)(refclk * fbdiv / refdiv);
	}

	return fvco;
}

struct stm32_pll_cfg {
	uint16_t pll_id;
};

static bool _clk_stm32_pll_is_enabled(struct stm32_clk_priv *priv, const struct stm32_clk_pll *pll)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;

	return ((mmio_read_32(pllxcfgr1) & RCC_PLLxCFGR1_PLLEN) != 0U);
}

static void _clk_stm32_pll_set_on(struct stm32_clk_priv *priv, const struct stm32_clk_pll *pll)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;

	mmio_setbits_32(pllxcfgr1, RCC_PLLxCFGR1_PLLEN);
}

static void _clk_stm32_pll_set_off(struct stm32_clk_priv *priv, const struct stm32_clk_pll *pll)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;

	/* Stop PLL */
	mmio_clrbits_32(pllxcfgr1, RCC_PLLxCFGR1_PLLEN);
}

static int _clk_stm32_pll_wait_ready_on(struct stm32_clk_priv *priv,
					const struct stm32_clk_pll *pll)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uint64_t timeout = timeout_init_us(PLLRDY_TIMEOUT);

	/* Wait PLL lock */
	while ((mmio_read_32(pllxcfgr1) & RCC_PLLxCFGR1_PLLRDY) == 0U) {
		if (timeout_elapsed(timeout)) {
			ERROR("CLK %d : PLL start failed @ 0x%x: 0x%x\n",
			      pll->clk_id, pll->reg_pllxcfgr1, mmio_read_32(pllxcfgr1));
			return -ETIMEDOUT;
		}
	}

	return 0;
}

static int _clk_stm32_pll_wait_ready_off(struct stm32_clk_priv *priv,
					 const struct stm32_clk_pll *pll)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uint64_t timeout = timeout_init_us(PLLRDY_TIMEOUT);

	/* Wait PLL stopped */
	while ((mmio_read_32(pllxcfgr1) & RCC_PLLxCFGR1_PLLRDY) != 0U) {
		if (timeout_elapsed(timeout)) {
			ERROR("PLL%d stop failed @ 0x%lx: 0x%x\n",
			      pll->clk_id, pllxcfgr1, mmio_read_32(pllxcfgr1));
			return -ETIMEDOUT;
		}
	}

	return 0;
}

static int _clk_stm32_pll_enable(struct stm32_clk_priv *priv, const struct stm32_clk_pll *pll)
{
	if (_clk_stm32_pll_is_enabled(priv, pll)) {
		return 0;
	}

	_clk_stm32_pll_set_on(priv, pll);

	return _clk_stm32_pll_wait_ready_on(priv, pll);
}

static void _clk_stm32_pll_disable(struct stm32_clk_priv *priv, const struct stm32_clk_pll *pll)
{
	if (!_clk_stm32_pll_is_enabled(priv, pll)) {
		return;
	}

	_clk_stm32_pll_set_off(priv, pll);

	_clk_stm32_pll_wait_ready_off(priv, pll);
}

static bool clk_stm32_pll_is_enabled(struct stm32_clk_priv *priv, int id)
{
	const struct clk_stm32 *clk = _clk_get(priv, id);
	struct stm32_pll_cfg *pll_cfg = clk->clock_cfg;
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_cfg->pll_id);

	return _clk_stm32_pll_is_enabled(priv, pll);
}

static int clk_stm32_pll_enable(struct stm32_clk_priv *priv, int id)
{
	const struct clk_stm32 *clk = _clk_get(priv, id);
	struct stm32_pll_cfg *pll_cfg = clk->clock_cfg;
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_cfg->pll_id);

	return _clk_stm32_pll_enable(priv, pll);
}

static void clk_stm32_pll_disable(struct stm32_clk_priv *priv, int id)
{
	const struct clk_stm32 *clk = _clk_get(priv, id);
	struct stm32_pll_cfg *pll_cfg = clk->clock_cfg;
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_cfg->pll_id);

	_clk_stm32_pll_disable(priv, pll);
}

static unsigned long clk_stm32_pll_recalc_rate(struct stm32_clk_priv *priv, int id,
					       unsigned long prate)
{
	const struct clk_stm32 *clk = _clk_get(priv, id);
	struct stm32_pll_cfg *pll_cfg = clk->clock_cfg;
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_cfg->pll_id);
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uintptr_t pllxcfgr4 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR4;
	uintptr_t pllxcfgr6 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR6;
	uintptr_t pllxcfgr7 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR7;
	unsigned long dfout;
	uint32_t postdiv1, postdiv2;

	postdiv1 = mmio_read_32(pllxcfgr6) & RCC_PLLxCFGR6_POSTDIV1_MASK;
	postdiv2 = mmio_read_32(pllxcfgr7) & RCC_PLLxCFGR7_POSTDIV2_MASK;

	if ((mmio_read_32(pllxcfgr4) & RCC_PLLxCFGR4_BYPASS) != 0U) {
		dfout = prate;
	} else {
		if ((postdiv1 == 0U) || (postdiv2 == 0U)) {
			dfout = prate;
		} else {
			dfout = clk_get_pll_fvco(priv, pll, prate) / (postdiv1 * postdiv2);
		}
	}

	return dfout;
}

static const struct stm32_clk_ops clk_stm32_pll_ops = {
	.recalc_rate	= clk_stm32_pll_recalc_rate,
	.enable		= clk_stm32_pll_enable,
	.disable	= clk_stm32_pll_disable,
	.is_enabled	= clk_stm32_pll_is_enabled,
};

#define CLK_PLL(idx, _idx, _parent, _pll_id, _flags)[idx] = {\
	.binding	= _idx,\
	.parent		= _parent,\
	.flags		= (_flags),\
	.clock_cfg	= &(struct stm32_pll_cfg) {\
		.pll_id	= _pll_id,\
	},\
	.ops		= STM32_PLL_OPS,\
}

