DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
static unsigned long clk_get_pll1_fvco(unsigned long refclk)
{
	uintptr_t pll_freq1_reg = A35SSC_BASE + A35_SS_PLL_FREQ1;
	uint32_t reg, fbdiv, refdiv;

	reg = mmio_read_32(pll_freq1_reg);

	fbdiv = (reg & A35_SS_PLL_FREQ1_FBDIV_MASK) >> A35_SS_PLL_FREQ1_FBDIV_SHIFT;
	refdiv = (reg & A35_SS_PLL_FREQ1_REFDIV_MASK) >> A35_SS_PLL_FREQ1_REFDIV_SHIFT;

	return (unsigned long)(refclk * fbdiv / refdiv);
}

static unsigned long clk_stm32_pll1_recalc_rate(struct stm32_clk_priv *priv,
						int id, unsigned long prate)
{
	uintptr_t pll_freq2_reg = A35SSC_BASE + A35_SS_PLL_FREQ2;
	uint32_t postdiv1, postdiv2;
	unsigned long dfout;

	postdiv1 = (mmio_read_32(pll_freq2_reg) & A35_SS_PLL_FREQ2_POSTDIV1_MASK) >>
		   A35_SS_PLL_FREQ2_POSTDIV1_SHIFT;
	postdiv2 = (mmio_read_32(pll_freq2_reg) & A35_SS_PLL_FREQ2_POSTDIV2_MASK) >>
		   A35_SS_PLL_FREQ2_POSTDIV2_SHIFT;

	if ((postdiv1 == 0U) || (postdiv2 == 0U)) {
		dfout = prate;
	} else {
		dfout = clk_get_pll1_fvco(prate) / (postdiv1 * postdiv2);
	}

	return dfout;
}

static const struct stm32_clk_ops clk_stm32_pll1_ops = {
	.recalc_rate = clk_stm32_pll1_recalc_rate,
};

#define CLK_PLL1(idx, _idx, _parent, _pll_id, _flags)[idx] = {\
	.binding	= _idx,\
	.parent		= _parent,\
	.flags		= (_flags),\
	.clock_cfg	= &(struct stm32_pll_cfg) {\
		.pll_id	= _pll_id,\
	},\
	.ops		= STM32_PLL1_OPS,\
}

struct stm32_clk_flexgen_cfg {
	uint8_t id;
};

static unsigned long clk_flexgen_recalc(struct stm32_clk_priv *priv, int idx,
					unsigned long prate)
{
	const struct clk_stm32 *clk = _clk_get(priv, idx);
	struct stm32_clk_flexgen_cfg *cfg = clk->clock_cfg;
	uintptr_t rcc_base = priv->base;
	uint32_t prediv, findiv;
	uint8_t channel = cfg->id;
	unsigned long freq = prate;

	prediv = mmio_read_32(rcc_base + RCC_PREDIV0CFGR + (0x4U * channel)) &
		RCC_PREDIVxCFGR_PREDIVx_MASK;
	findiv = mmio_read_32(rcc_base + RCC_FINDIV0CFGR + (0x4U * channel)) &
		RCC_FINDIVxCFGR_FINDIVx_MASK;

	if (freq == 0UL) {
		return 0U;
	}

	switch (prediv) {
	case 0x0:
	case 0x1:
	case 0x3:
	case 0x3FF:
		break;

	default:
		ERROR("Unsupported PREDIV value (%x)\n", prediv);
		panic();
		break;
	}

	freq /= (prediv + 1U);
	freq /= (findiv + 1U);

	return freq;
}

static int clk_flexgen_get_parent(struct stm32_clk_priv *priv, int idx)
{
	const struct clk_stm32 *clk = _clk_get(priv, idx);
	struct stm32_clk_flexgen_cfg *cfg = clk->clock_cfg;
	uint32_t sel;
	uint32_t address;
	uintptr_t rcc_base = priv->base;

	address = RCC_XBAR0CFGR + (cfg->id * 4);

	sel = mmio_read_32(rcc_base + address) & RCC_XBARxCFGR_XBARxSEL_MASK;

	return sel;
}

static int clk_flexgen_gate_enable(struct stm32_clk_priv *priv, int idx)
{
	const struct clk_stm32 *clk = _clk_get(priv, idx);
	struct stm32_clk_flexgen_cfg *cfg = clk->clock_cfg;
	uintptr_t rcc_base = priv->base;
	uint8_t channel = cfg->id;

	mmio_setbits_32(rcc_base + RCC_FINDIV0CFGR + (0x4U * channel),
			RCC_FINDIVxCFGR_FINDIVxEN);

	return 0;
}

static void clk_flexgen_gate_disable(struct stm32_clk_priv *priv, int id)
{
	const struct clk_stm32 *clk = _clk_get(priv, id);
	struct stm32_clk_flexgen_cfg *cfg = clk->clock_cfg;
	uintptr_t rcc_base = priv->base;
	uint8_t channel = cfg->id;

	mmio_clrbits_32(rcc_base + RCC_FINDIV0CFGR + (0x4U * channel),
			RCC_FINDIVxCFGR_FINDIVxEN);
}

static bool clk_flexgen_gate_is_enabled(struct stm32_clk_priv *priv, int id)
{
	const struct clk_stm32 *clk = _clk_get(priv, id);
	struct stm32_clk_flexgen_cfg *cfg = clk->clock_cfg;
	uintptr_t rcc_base = priv->base;
	uint8_t channel = cfg->id;

	return !!(mmio_read_32(rcc_base + RCC_FINDIV0CFGR + (0x4U * channel)) &
		RCC_FINDIVxCFGR_FINDIVxEN);
}

static const struct stm32_clk_ops clk_stm32_flexgen_ops = {
	.recalc_rate = clk_flexgen_recalc,
	.get_parent = clk_flexgen_get_parent,
	.enable = clk_flexgen_gate_enable,
	.disable = clk_flexgen_gate_disable,
	.is_enabled = clk_flexgen_gate_is_enabled,
};

#define FLEXGEN(idx, _idx, _flags, _id)[idx] = {\
	.binding = _idx,\
	.parent =  MUX(MUX_XBARSEL),\
	.flags = (_flags),\
	.clock_cfg	= &(struct stm32_clk_flexgen_cfg) {\
		.id	= _id,\
	},\
	.ops = STM32_FLEXGEN_OPS,\
}

#define RCC_0_MHZ	UL(0)
#define RCC_4_MHZ	UL(4000000)
#define RCC_16_MHZ	UL(16000000)

#ifdef IMAGE_BL2
#if !STM32MP_M33_TDCID
static int clk_stm32_osc_msi_set_rate(struct stm32_clk_priv *priv, int id, unsigned long rate,
				      unsigned long prate)
{
	uintptr_t address = priv->base + RCC_BDCR;
	uint32_t mask = RCC_BDCR_MSIFREQSEL;
	int ret = -1;

	switch (rate) {
	case RCC_4_MHZ:
		mmio_clrbits_32(address, mask);
		ret = 0;
		break;

	case RCC_16_MHZ:
		mmio_setbits_32(address, mask);
		ret = 0;
		break;

	default:
		break;
	}

	return ret;
}
#endif
#endif /* IMAGE_BL2 */

static unsigned long clk_stm32_osc_msi_recalc_rate(struct stm32_clk_priv *priv,
						   int id __unused,
						   unsigned long prate __unused)
{
	uintptr_t address = priv->base + RCC_BDCR;

	if ((mmio_read_32(address) & RCC_BDCR_MSIFREQSEL) == 0U) {
		return RCC_4_MHZ;
	} else {
		return RCC_16_MHZ;
	}
}

static const struct stm32_clk_ops clk_stm32_osc_msi_ops = {
	.recalc_rate	= clk_stm32_osc_msi_recalc_rate,
	.is_enabled	= clk_stm32_osc_gate_is_enabled,
#if !STM32MP_M33_TDCID
	.enable		= clk_stm32_osc_gate_enable,
	.disable	= clk_stm32_osc_gate_disable,
#endif
	.init		= clk_stm32_osc_init,
};

#define CLK_OSC_MSI(idx, _idx, _parent, _osc_id) \
	[(idx)] = (struct clk_stm32){ \
		.binding	= (_idx),\
		.parent		= (_parent),\
		.flags		= CLK_IS_CRITICAL,\
		.clock_cfg	= &(struct stm32_osc_cfg){\
			.osc_id = (_osc_id),\
		},\
		.ops		= STM32_OSC_MSI_OPS,\
	}

static const struct stm32_clk_ops clk_stm32_rtc_ops = {
	.enable = clk_stm32_gate_enable,
	.disable = clk_stm32_gate_disable,
	.is_enabled = clk_stm32_gate_is_enabled,
};

#define CLK_RTC(idx, _binding, _parent, _flags, _gate_id)[idx] = {\
	.binding = (_binding),\
	.parent =  (_parent),\
	.flags = (_flags),\
	.clock_cfg	= &(struct clk_stm32_gate_cfg) {\
		.id	= (_gate_id),\
	},\
	.ops = STM32_RTC_OPS,\
}

enum {
	STM32_PLL_OPS = STM32_LAST_OPS,
	STM32_PLL1_OPS,
	STM32_FLEXGEN_OPS,
	STM32_OSC_MSI_OPS,
	STM32_RTC_OPS,

	MP25_LAST_OPS
};

static const struct stm32_clk_ops *ops_array_mp25[MP25_LAST_OPS] = {
	[NO_OPS] =  NULL,
	[FIXED_FACTOR_OPS] = &clk_fixed_factor_ops,
	[GATE_OPS] = &clk_gate_ops,
	[STM32_MUX_OPS] = &clk_mux_ops,
	[STM32_DIVIDER_OPS] = &clk_stm32_divider_ops,
	[STM32_GATE_OPS] = &clk_stm32_gate_ops,
	[STM32_TIMER_OPS] = &clk_timer_ops,
	[STM32_FIXED_RATE_OPS] = &clk_stm32_fixed_rate_ops,
	[STM32_OSC_OPS] = &clk_stm32_osc_ops,
	[STM32_OSC_NOGATE_OPS] = &clk_stm32_osc_nogate_ops,

