DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
	[STM32_PLL_OPS] = &clk_stm32_pll_ops,
	[STM32_PLL1_OPS] = &clk_stm32_pll1_ops,
	[STM32_FLEXGEN_OPS] = &clk_stm32_flexgen_ops,
	[STM32_OSC_MSI_OPS] = &clk_stm32_osc_msi_ops,
	[STM32_RTC_OPS] = &clk_stm32_rtc_ops
};

static const struct clk_stm32 stm32mp25_clk[CK_LAST] = {
	CLK_FIXED_RATE(_CK_0_MHZ, _NO_ID, RCC_0_MHZ),

	/* ROOT CLOCKS */
	CLK_OSC(_CK_HSE, HSE_CK, CLK_IS_ROOT, OSC_HSE),
	CLK_OSC(_CK_LSE, LSE_CK, CLK_IS_ROOT, OSC_LSE),
	CLK_OSC(_CK_HSI, HSI_CK, CLK_IS_ROOT, OSC_HSI),
	CLK_OSC(_CK_LSI, LSI_CK, CLK_IS_ROOT, OSC_LSI),
	CLK_OSC_MSI(_CK_MSI, MSI_CK, CLK_IS_ROOT, OSC_MSI),

	CLK_OSC_FIXED(_I2SCKIN, _NO_ID, CLK_IS_ROOT, OSC_I2SCKIN),
	CLK_OSC_FIXED(_SPDIFSYMB, _NO_ID, CLK_IS_ROOT, OSC_SPDIFSYMB),

	STM32_DIV(_CK_HSE_RTC, _NO_ID, _CK_HSE, 0, DIV_RTC),

	CLK_RTC(_CK_RTCCK, RTC_CK, MUX(MUX_RTC), 0, GATE_RTCCK),

	CLK_PLL1(_CK_PLL1, PLL1_CK, MUX(MUX_MUXSEL5), _PLL1, 0),

	CLK_PLL(_CK_PLL2, PLL2_CK, MUX(MUX_MUXSEL6), _PLL2, 0),
	CLK_PLL(_CK_PLL3, PLL3_CK, MUX(MUX_MUXSEL7), _PLL3, 0),
	CLK_PLL(_CK_PLL4, PLL4_CK, MUX(MUX_MUXSEL0), _PLL4, 0),
	CLK_PLL(_CK_PLL5, PLL5_CK, MUX(MUX_MUXSEL1), _PLL5, 0),
	CLK_PLL(_CK_PLL6, PLL6_CK, MUX(MUX_MUXSEL2), _PLL6, 0),
	CLK_PLL(_CK_PLL7, PLL7_CK, MUX(MUX_MUXSEL3), _PLL7, 0),
	CLK_PLL(_CK_PLL8, PLL8_CK, MUX(MUX_MUXSEL4), _PLL8, 0),

	FLEXGEN(_CK_ICN_HS_MCU,	CK_ICN_HS_MCU, CLK_IS_CRITICAL, 0),
	FLEXGEN(_CK_ICN_SDMMC, CK_ICN_SDMMC, CLK_IS_CRITICAL, 1),
	FLEXGEN(_CK_ICN_DDR, CK_ICN_DDR, CLK_IS_CRITICAL, 2),
	FLEXGEN(_CK_ICN_HSL, CK_ICN_HSL, CLK_IS_CRITICAL, 4),
	FLEXGEN(_CK_ICN_NIC, CK_ICN_NIC, CLK_IS_CRITICAL, 5),

	STM32_DIV(_CK_ICN_LS_MCU, CK_ICN_LS_MCU, _CK_ICN_HS_MCU, 0, DIV_LSMCU),

	FLEXGEN(_CK_FLEXGEN_07, CK_FLEXGEN_07, 0, 7),
	FLEXGEN(_CK_FLEXGEN_08, CK_FLEXGEN_08, 0, 8),
	FLEXGEN(_CK_FLEXGEN_09, CK_FLEXGEN_09, 0, 9),
	FLEXGEN(_CK_FLEXGEN_10, CK_FLEXGEN_10, 0, 10),
	FLEXGEN(_CK_FLEXGEN_11, CK_FLEXGEN_11, 0, 11),
	FLEXGEN(_CK_FLEXGEN_12, CK_FLEXGEN_12, 0, 12),
	FLEXGEN(_CK_FLEXGEN_13, CK_FLEXGEN_13, 0, 13),
	FLEXGEN(_CK_FLEXGEN_14, CK_FLEXGEN_14, 0, 14),
	FLEXGEN(_CK_FLEXGEN_15, CK_FLEXGEN_15, 0, 15),
	FLEXGEN(_CK_FLEXGEN_16, CK_FLEXGEN_16, 0, 16),
	FLEXGEN(_CK_FLEXGEN_17, CK_FLEXGEN_17, 0, 17),
	FLEXGEN(_CK_FLEXGEN_18, CK_FLEXGEN_18, 0, 18),
	FLEXGEN(_CK_FLEXGEN_19, CK_FLEXGEN_19, 0, 19),
	FLEXGEN(_CK_FLEXGEN_20, CK_FLEXGEN_20, 0, 20),
	FLEXGEN(_CK_FLEXGEN_21, CK_FLEXGEN_21, 0, 21),
	FLEXGEN(_CK_FLEXGEN_22, CK_FLEXGEN_22, 0, 22),
	FLEXGEN(_CK_FLEXGEN_23, CK_FLEXGEN_23, 0, 23),
	FLEXGEN(_CK_FLEXGEN_24, CK_FLEXGEN_24, 0, 24),
	FLEXGEN(_CK_FLEXGEN_25, CK_FLEXGEN_25, 0, 25),
	FLEXGEN(_CK_FLEXGEN_26, CK_FLEXGEN_26, 0, 26),
	FLEXGEN(_CK_FLEXGEN_27, CK_FLEXGEN_27, 0, 27),
	FLEXGEN(_CK_FLEXGEN_28, CK_FLEXGEN_28, 0, 28),
	FLEXGEN(_CK_FLEXGEN_29, CK_FLEXGEN_29, 0, 29),
	FLEXGEN(_CK_FLEXGEN_30, CK_FLEXGEN_30, 0, 30),
	FLEXGEN(_CK_FLEXGEN_31, CK_FLEXGEN_31, 0, 31),
	FLEXGEN(_CK_FLEXGEN_32, CK_FLEXGEN_32, 0, 32),
	FLEXGEN(_CK_FLEXGEN_33, CK_FLEXGEN_33, 0, 33),
	FLEXGEN(_CK_FLEXGEN_34, CK_FLEXGEN_34, 0, 34),
	FLEXGEN(_CK_FLEXGEN_35, CK_FLEXGEN_35, 0, 35),
	FLEXGEN(_CK_FLEXGEN_36, CK_FLEXGEN_36, 0, 36),
	FLEXGEN(_CK_FLEXGEN_37, CK_FLEXGEN_37, 0, 37),
	FLEXGEN(_CK_FLEXGEN_38, CK_FLEXGEN_38, 0, 38),
	FLEXGEN(_CK_FLEXGEN_39, CK_FLEXGEN_39, 0, 39),
	FLEXGEN(_CK_FLEXGEN_40, CK_FLEXGEN_40, 0, 40),
	FLEXGEN(_CK_FLEXGEN_41, CK_FLEXGEN_41, 0, 41),
	FLEXGEN(_CK_FLEXGEN_42, CK_FLEXGEN_42, 0, 42),
	FLEXGEN(_CK_FLEXGEN_43, CK_FLEXGEN_43, 0, 43),
	FLEXGEN(_CK_FLEXGEN_44, CK_FLEXGEN_44, 0, 44),
	FLEXGEN(_CK_FLEXGEN_45, CK_FLEXGEN_45, 0, 45),
	FLEXGEN(_CK_FLEXGEN_46, CK_FLEXGEN_46, 0, 46),
	FLEXGEN(_CK_FLEXGEN_47, CK_FLEXGEN_47, 0, 47),
	FLEXGEN(_CK_FLEXGEN_48, CK_FLEXGEN_48, 0, 48),
	FLEXGEN(_CK_FLEXGEN_49, CK_FLEXGEN_49, 0, 49),
	FLEXGEN(_CK_FLEXGEN_50, CK_FLEXGEN_50, 0, 50),
	FLEXGEN(_CK_FLEXGEN_51, CK_FLEXGEN_51, 0, 51),
	FLEXGEN(_CK_FLEXGEN_52, CK_FLEXGEN_52, 0, 52),
	FLEXGEN(_CK_FLEXGEN_53, CK_FLEXGEN_53, 0, 53),
	FLEXGEN(_CK_FLEXGEN_54, CK_FLEXGEN_54, 0, 54),
	FLEXGEN(_CK_FLEXGEN_55, CK_FLEXGEN_55, 0, 55),
	FLEXGEN(_CK_FLEXGEN_56, CK_FLEXGEN_56, 0, 56),
	FLEXGEN(_CK_FLEXGEN_57, CK_FLEXGEN_57, 0, 57),
	FLEXGEN(_CK_FLEXGEN_58, CK_FLEXGEN_58, 0, 58),
	FLEXGEN(_CK_FLEXGEN_59, CK_FLEXGEN_59, 0, 59),
	FLEXGEN(_CK_FLEXGEN_60, CK_FLEXGEN_60, 0, 60),
	FLEXGEN(_CK_FLEXGEN_61, CK_FLEXGEN_61, 0, 61),
	FLEXGEN(_CK_FLEXGEN_62, CK_FLEXGEN_62, 0, 62),
	FLEXGEN(_CK_FLEXGEN_63, CK_FLEXGEN_63, 0, 63),

	STM32_DIV(_CK_ICN_APB1, CK_ICN_APB1, _CK_ICN_LS_MCU, 0, DIV_APB1),
	STM32_DIV(_CK_ICN_APB2, CK_ICN_APB2, _CK_ICN_LS_MCU, 0, DIV_APB2),
	STM32_DIV(_CK_ICN_APB3, CK_ICN_APB3, _CK_ICN_LS_MCU, 0, DIV_APB3),
	STM32_DIV(_CK_ICN_APB4, CK_ICN_APB4, _CK_ICN_LS_MCU, 0, DIV_APB4),
	STM32_DIV(_CK_ICN_APBDBG, CK_ICN_APBDBG, _CK_ICN_LS_MCU, 0, DIV_APBDBG),

	/* KERNEL CLOCK */
	STM32_GATE(_CK_SYSRAM, CK_BUS_SYSRAM, _CK_ICN_HS_MCU, 0, GATE_SYSRAM),
	STM32_GATE(_CK_RETRAM, CK_BUS_RETRAM, _CK_ICN_HS_MCU, 0, GATE_RETRAM),
	STM32_GATE(_CK_SRAM1, CK_BUS_SRAM1, _CK_ICN_HS_MCU, CLK_IS_CRITICAL, GATE_SRAM1),
	STM32_GATE(_CK_SRAM2, CK_BUS_SRAM2, _CK_ICN_HS_MCU, CLK_IS_CRITICAL, GATE_SRAM2),

	STM32_GATE(_CK_DDRPHYC, CK_BUS_DDRPHYC, _CK_ICN_LS_MCU, 0, GATE_DDRPHYC),
	STM32_GATE(_CK_SYSCPU1, CK_BUS_SYSCPU1, _CK_ICN_LS_MCU, 0, GATE_SYSCPU1),
	STM32_GATE(_CK_CRC, CK_BUS_CRC, _CK_ICN_LS_MCU, 0, GATE_CRC),
	STM32_GATE(_CK_OSPIIOM, CK_BUS_OSPIIOM, _CK_ICN_LS_MCU, 0, GATE_OSPIIOM),
	STM32_GATE(_CK_BKPSRAM, CK_BUS_BKPSRAM, _CK_ICN_LS_MCU, 0, GATE_BKPSRAM),
	STM32_GATE(_CK_HASH, CK_BUS_HASH, _CK_ICN_LS_MCU, 0, GATE_HASH),
	STM32_GATE(_CK_RNG, CK_BUS_RNG, _CK_ICN_LS_MCU, 0, GATE_RNG),
	STM32_GATE(_CK_CRYP1, CK_BUS_CRYP1, _CK_ICN_LS_MCU, 0, GATE_CRYP1),
	STM32_GATE(_CK_CRYP2, CK_BUS_CRYP2, _CK_ICN_LS_MCU, 0, GATE_CRYP2),
	STM32_GATE(_CK_SAES, CK_BUS_SAES, _CK_ICN_LS_MCU, 0, GATE_SAES),
	STM32_GATE(_CK_PKA, CK_BUS_PKA, _CK_ICN_LS_MCU, 0, GATE_PKA),

	STM32_GATE(_CK_GPIOA, CK_BUS_GPIOA, _CK_ICN_LS_MCU, 0, GATE_GPIOA),
	STM32_GATE(_CK_GPIOB, CK_BUS_GPIOB, _CK_ICN_LS_MCU, 0, GATE_GPIOB),
	STM32_GATE(_CK_GPIOC, CK_BUS_GPIOC, _CK_ICN_LS_MCU, 0, GATE_GPIOC),
	STM32_GATE(_CK_GPIOD, CK_BUS_GPIOD, _CK_ICN_LS_MCU, 0, GATE_GPIOD),
	STM32_GATE(_CK_GPIOE, CK_BUS_GPIOE, _CK_ICN_LS_MCU, 0, GATE_GPIOE),
	STM32_GATE(_CK_GPIOF, CK_BUS_GPIOF, _CK_ICN_LS_MCU, 0, GATE_GPIOF),
	STM32_GATE(_CK_GPIOG, CK_BUS_GPIOG, _CK_ICN_LS_MCU, 0, GATE_GPIOG),
	STM32_GATE(_CK_GPIOH, CK_BUS_GPIOH, _CK_ICN_LS_MCU, 0, GATE_GPIOH),
	STM32_GATE(_CK_GPIOI, CK_BUS_GPIOI, _CK_ICN_LS_MCU, 0, GATE_GPIOI),
	STM32_GATE(_CK_GPIOJ, CK_BUS_GPIOJ, _CK_ICN_LS_MCU, 0, GATE_GPIOJ),
	STM32_GATE(_CK_GPIOK, CK_BUS_GPIOK, _CK_ICN_LS_MCU, 0, GATE_GPIOK),
	STM32_GATE(_CK_GPIOZ, CK_BUS_GPIOZ, _CK_ICN_LS_MCU, 0, GATE_GPIOZ),
	STM32_GATE(_CK_RTC, CK_BUS_RTC, _CK_ICN_LS_MCU, 0, GATE_RTC),

	STM32_GATE(_CK_DDRCP, CK_BUS_DDR, _CK_ICN_DDR, 0, GATE_DDRCP),

	/* WARNING 2 CLOCKS FOR ONE GATE */
	STM32_GATE(_CK_USB2OHCI, CK_BUS_USB2OHCI, _CK_ICN_HSL, 0, GATE_USB2OHCI),
	STM32_GATE(_CK_USB2EHCI, CK_BUS_USB2EHCI, _CK_ICN_HSL, 0, GATE_USB2EHCI),

	STM32_GATE(_CK_USB3DR, CK_BUS_USB3DR, _CK_ICN_HSL, 0, GATE_USB3DR),

