DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
	STM32_GATE(_CK_BSEC, CK_BUS_BSEC, _CK_ICN_APB3, 0, GATE_BSEC),
	STM32_GATE(_CK_IWDG1, CK_BUS_IWDG1, _CK_ICN_APB3, 0, GATE_IWDG1),
	STM32_GATE(_CK_IWDG2, CK_BUS_IWDG2, _CK_ICN_APB3, 0, GATE_IWDG2),

	STM32_GATE(_CK_DDRCAPB, CK_BUS_DDRC, _CK_ICN_APB4, 0, GATE_DDRCAPB),
	STM32_GATE(_CK_DDR, CK_BUS_DDRCFG, _CK_ICN_APB4, 0, GATE_DDR),

	STM32_GATE(_CK_USART2, CK_KER_USART2, _CK_FLEXGEN_08, 0, GATE_USART2),
	STM32_GATE(_CK_UART4, CK_KER_UART4, _CK_FLEXGEN_08, 0, GATE_UART4),
	STM32_GATE(_CK_USART3, CK_KER_USART3, _CK_FLEXGEN_09, 0, GATE_USART3),
	STM32_GATE(_CK_UART5, CK_KER_UART5, _CK_FLEXGEN_09, 0, GATE_UART5),
	STM32_GATE(_CK_I2C1, CK_KER_I2C1, _CK_FLEXGEN_12, 0, GATE_I2C1),
	STM32_GATE(_CK_I2C2, CK_KER_I2C2, _CK_FLEXGEN_12, 0, GATE_I2C2),
	STM32_GATE(_CK_I2C3, CK_KER_I2C3, _CK_FLEXGEN_13, 0, GATE_I2C3),
	STM32_GATE(_CK_I2C5, CK_KER_I2C5, _CK_FLEXGEN_13, 0, GATE_I2C5),
	STM32_GATE(_CK_I2C4, CK_KER_I2C4, _CK_FLEXGEN_14, 0, GATE_I2C4),
	STM32_GATE(_CK_I2C6, CK_KER_I2C6, _CK_FLEXGEN_14, 0, GATE_I2C6),
	STM32_GATE(_CK_I2C7, CK_KER_I2C7, _CK_FLEXGEN_15, 0, GATE_I2C7),
	STM32_GATE(_CK_USART1, CK_KER_USART1, _CK_FLEXGEN_19, 0, GATE_USART1),
	STM32_GATE(_CK_USART6, CK_KER_USART6, _CK_FLEXGEN_20, 0, GATE_USART6),
	STM32_GATE(_CK_UART7, CK_KER_UART7, _CK_FLEXGEN_21, 0, GATE_UART7),
	STM32_GATE(_CK_UART8, CK_KER_UART8, _CK_FLEXGEN_21, 0, GATE_UART8),
	STM32_GATE(_CK_UART9, CK_KER_UART9, _CK_FLEXGEN_22, 0, GATE_UART9),
	STM32_GATE(_CK_STGEN, CK_KER_STGEN, _CK_FLEXGEN_33, 0, GATE_STGEN),
	STM32_GATE(_CK_USB3PCIEPHY, CK_KER_USB3PCIEPHY, _CK_FLEXGEN_34, 0, GATE_USB3PCIEPHY),
	STM32_GATE(_CK_USBTC, CK_KER_USBTC, _CK_FLEXGEN_35, 0, GATE_USBTC),
	STM32_GATE(_CK_I2C8, CK_KER_I2C8, _CK_FLEXGEN_38, 0, GATE_I2C8),
	STM32_GATE(_CK_OSPI1, CK_KER_OSPI1, _CK_FLEXGEN_48, 0, GATE_OSPI1),
	STM32_GATE(_CK_OSPI2, CK_KER_OSPI2, _CK_FLEXGEN_49, 0, GATE_OSPI2),
	STM32_GATE(_CK_FMC, CK_KER_FMC, _CK_FLEXGEN_50, 0, GATE_FMC),
	STM32_GATE(_CK_SDMMC1, CK_KER_SDMMC1, _CK_FLEXGEN_51, 0, GATE_SDMMC1),
	STM32_GATE(_CK_SDMMC2, CK_KER_SDMMC2, _CK_FLEXGEN_52, 0, GATE_SDMMC2),
	STM32_GATE(_CK_USB2PHY1, CK_KER_USB2PHY1, _CK_FLEXGEN_57, 0, GATE_USB2PHY1),
	STM32_GATE(_CK_USB2PHY2, CK_KER_USB2PHY2, _CK_FLEXGEN_58, 0, GATE_USB2PHY2),
};

enum clksrc_id {
	CLKSRC_CA35SS,
	CLKSRC_PLL1,
	CLKSRC_PLL2,
	CLKSRC_PLL3,
	CLKSRC_PLL4,
	CLKSRC_PLL5,
	CLKSRC_PLL6,
	CLKSRC_PLL7,
	CLKSRC_PLL8,
	CLKSRC_XBAR_CHANNEL0,
	CLKSRC_XBAR_CHANNEL1,
	CLKSRC_XBAR_CHANNEL2,
	CLKSRC_XBAR_CHANNEL3,
	CLKSRC_XBAR_CHANNEL4,
	CLKSRC_XBAR_CHANNEL5,
	CLKSRC_XBAR_CHANNEL6,
	CLKSRC_XBAR_CHANNEL7,
	CLKSRC_XBAR_CHANNEL8,
	CLKSRC_XBAR_CHANNEL9,
	CLKSRC_XBAR_CHANNEL10,
	CLKSRC_XBAR_CHANNEL11,
	CLKSRC_XBAR_CHANNEL12,
	CLKSRC_XBAR_CHANNEL13,
	CLKSRC_XBAR_CHANNEL14,
	CLKSRC_XBAR_CHANNEL15,
	CLKSRC_XBAR_CHANNEL16,
	CLKSRC_XBAR_CHANNEL17,
	CLKSRC_XBAR_CHANNEL18,
	CLKSRC_XBAR_CHANNEL19,
	CLKSRC_XBAR_CHANNEL20,
	CLKSRC_XBAR_CHANNEL21,
	CLKSRC_XBAR_CHANNEL22,
	CLKSRC_XBAR_CHANNEL23,
	CLKSRC_XBAR_CHANNEL24,
	CLKSRC_XBAR_CHANNEL25,
	CLKSRC_XBAR_CHANNEL26,
	CLKSRC_XBAR_CHANNEL27,
	CLKSRC_XBAR_CHANNEL28,
	CLKSRC_XBAR_CHANNEL29,
	CLKSRC_XBAR_CHANNEL30,
	CLKSRC_XBAR_CHANNEL31,
	CLKSRC_XBAR_CHANNEL32,
	CLKSRC_XBAR_CHANNEL33,
	CLKSRC_XBAR_CHANNEL34,
	CLKSRC_XBAR_CHANNEL35,
	CLKSRC_XBAR_CHANNEL36,
	CLKSRC_XBAR_CHANNEL37,
	CLKSRC_XBAR_CHANNEL38,
	CLKSRC_XBAR_CHANNEL39,
	CLKSRC_XBAR_CHANNEL40,
	CLKSRC_XBAR_CHANNEL41,
	CLKSRC_XBAR_CHANNEL42,
	CLKSRC_XBAR_CHANNEL43,
	CLKSRC_XBAR_CHANNEL44,
	CLKSRC_XBAR_CHANNEL45,
	CLKSRC_XBAR_CHANNEL46,
	CLKSRC_XBAR_CHANNEL47,
	CLKSRC_XBAR_CHANNEL48,
	CLKSRC_XBAR_CHANNEL49,
	CLKSRC_XBAR_CHANNEL50,
	CLKSRC_XBAR_CHANNEL51,
	CLKSRC_XBAR_CHANNEL52,
	CLKSRC_XBAR_CHANNEL53,
	CLKSRC_XBAR_CHANNEL54,
	CLKSRC_XBAR_CHANNEL55,
	CLKSRC_XBAR_CHANNEL56,
	CLKSRC_XBAR_CHANNEL57,
	CLKSRC_XBAR_CHANNEL58,
	CLKSRC_XBAR_CHANNEL59,
	CLKSRC_XBAR_CHANNEL60,
	CLKSRC_XBAR_CHANNEL61,
	CLKSRC_XBAR_CHANNEL62,
	CLKSRC_XBAR_CHANNEL63,
	CLKSRC_RTC,
	CLKSRC_MCO1,
	CLKSRC_MCO2,
	CLKSRC_NB
};

static void stm32mp2_a35_ss_on_hsi(void)
{
	uintptr_t a35_ss_address = A35SSC_BASE;
	uintptr_t chgclkreq_reg = a35_ss_address + A35_SS_CHGCLKREQ;
	uintptr_t pll_enable_reg = a35_ss_address + A35_SS_PLL_ENABLE;
	uint64_t timeout;

	if ((mmio_read_32(chgclkreq_reg) & A35_SS_CHGCLKREQ_ARM_CHGCLKACK) ==
	    A35_SS_CHGCLKREQ_ARM_CHGCLKACK) {
		/* Nothing to do, clock source is already set on bypass clock */
		return;
	}

	mmio_setbits_32(chgclkreq_reg, A35_SS_CHGCLKREQ_ARM_CHGCLKREQ);

	timeout = timeout_init_us(CLKSRC_TIMEOUT);
	while ((mmio_read_32(chgclkreq_reg) & A35_SS_CHGCLKREQ_ARM_CHGCLKACK) !=
	       A35_SS_CHGCLKREQ_ARM_CHGCLKACK) {
		if (timeout_elapsed(timeout)) {
			EARLY_ERROR("Cannot switch A35 to bypass clock\n");
			panic();
		}
	}

	mmio_clrbits_32(pll_enable_reg, A35_SS_PLL_ENABLE_NRESET_SWPLL_FF);
}

#ifdef IMAGE_BL2
static void stm32mp2_clk_muxsel_on_hsi(struct stm32_clk_priv *priv)
{
#if !STM32MP_M33_TDCID
	mmio_clrbits_32(priv->base + RCC_MUXSELCFGR,
			RCC_MUXSELCFGR_MUXSEL0_MASK |
			RCC_MUXSELCFGR_MUXSEL1_MASK |
			RCC_MUXSELCFGR_MUXSEL2_MASK |
			RCC_MUXSELCFGR_MUXSEL3_MASK |
			RCC_MUXSELCFGR_MUXSEL4_MASK |
			RCC_MUXSELCFGR_MUXSEL5_MASK |
			RCC_MUXSELCFGR_MUXSEL6_MASK |
			RCC_MUXSELCFGR_MUXSEL7_MASK);
#else
	/* MUXSEL5 for PLL1 selection = CA35 clock source, always accessible */
	mmio_clrbits_32(priv->base + RCC_MUXSELCFGR,
			RCC_MUXSELCFGR_MUXSEL5_MASK);
#endif
}

#if !STM32MP_M33_TDCID
static void stm32mp2_clk_xbar_on_hsi(struct stm32_clk_priv *priv)
{
	uintptr_t xbar0cfgr = priv->base + RCC_XBAR0CFGR;
	uint32_t i;

	for (i = 0; i < XBAR_CHANNEL_NB; i++) {
		mmio_clrsetbits_32(xbar0cfgr + (0x4 * i),
				   RCC_XBAR0CFGR_XBAR0SEL_MASK,
				   XBAR_SRC_HSI);
	}
}
#endif

/* TODO: MOVE THIS FUNCTION A35 ONLY */
static int stm32mp2_a35_pll1_start(void)
{
	uintptr_t a35_ss_address = A35SSC_BASE;
	uintptr_t pll_enable_reg = a35_ss_address + A35_SS_PLL_ENABLE;
	uintptr_t chgclkreq_reg = a35_ss_address + A35_SS_CHGCLKREQ;
	uint64_t timeout = timeout_init_us(PLLRDY_TIMEOUT);

	mmio_setbits_32(pll_enable_reg, A35_SS_PLL_ENABLE_PD);

	/* Wait PLL lock */
	while ((mmio_read_32(pll_enable_reg) & A35_SS_PLL_ENABLE_LOCKP) == 0U) {
		if (timeout_elapsed(timeout)) {
			EARLY_ERROR("PLL1 start failed @ 0x%lx: 0x%x\n",
				    pll_enable_reg, mmio_read_32(pll_enable_reg));
			return -ETIMEDOUT;
		}
	}

	/* De-assert reset on PLL output clock path */
	mmio_setbits_32(pll_enable_reg, A35_SS_PLL_ENABLE_NRESET_SWPLL_FF);

	/* Switch CPU clock to PLL clock */
	mmio_clrbits_32(chgclkreq_reg, A35_SS_CHGCLKREQ_ARM_CHGCLKREQ);

	/* Wait for clock change acknowledge */
	timeout = timeout_init_us(CLKSRC_TIMEOUT);
	while ((mmio_read_32(chgclkreq_reg) & A35_SS_CHGCLKREQ_ARM_CHGCLKACK) != 0U) {
		if (timeout_elapsed(timeout)) {
			EARLY_ERROR("CA35SS switch to PLL1 failed @ 0x%lx: 0x%x\n",
				    chgclkreq_reg, mmio_read_32(chgclkreq_reg));
			return -ETIMEDOUT;
		}
	}

