DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
	return 0;
}

static void stm32mp2_a35_pll1_config(uint32_t fbdiv, uint32_t refdiv, uint32_t postdiv1,
				     uint32_t postdiv2)
{
	uintptr_t a35_ss_address = A35SSC_BASE;
	uintptr_t pll_freq1_reg = a35_ss_address + A35_SS_PLL_FREQ1;
	uintptr_t pll_freq2_reg = a35_ss_address + A35_SS_PLL_FREQ2;

	mmio_clrsetbits_32(pll_freq1_reg, A35_SS_PLL_FREQ1_REFDIV_MASK,
			   (refdiv << A35_SS_PLL_FREQ1_REFDIV_SHIFT) &
			   A35_SS_PLL_FREQ1_REFDIV_MASK);

	mmio_clrsetbits_32(pll_freq1_reg, A35_SS_PLL_FREQ1_FBDIV_MASK,
			   (fbdiv << A35_SS_PLL_FREQ1_FBDIV_SHIFT) &
			   A35_SS_PLL_FREQ1_FBDIV_MASK);

	mmio_clrsetbits_32(pll_freq2_reg, A35_SS_PLL_FREQ2_POSTDIV1_MASK,
			   (postdiv1 << A35_SS_PLL_FREQ2_POSTDIV1_SHIFT) &
			   A35_SS_PLL_FREQ2_POSTDIV1_MASK);

	mmio_clrsetbits_32(pll_freq2_reg, A35_SS_PLL_FREQ2_POSTDIV2_MASK,
			   (postdiv2 << A35_SS_PLL_FREQ2_POSTDIV2_SHIFT) &
			   A35_SS_PLL_FREQ2_POSTDIV2_MASK);
}

static int clk_stm32_pll_config_output(struct stm32_clk_priv *priv,
				       const struct stm32_clk_pll *pll,
				       uint32_t *pllcfg,
				       uint32_t fracv)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uintptr_t pllxcfgr2 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR2;
	uintptr_t pllxcfgr3 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR3;
	uintptr_t pllxcfgr4 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR4;
	uintptr_t pllxcfgr6 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR6;
	uintptr_t pllxcfgr7 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR7;
	unsigned long refclk;

	refclk = _clk_stm32_get_parent_rate(priv, pll->clk_id);

	if (fracv == 0U) {
		/* PLL in integer mode */

		/*
		 * No need to check max clock, as oscillator reference clocks
		 * will always be less than 1.2GHz
		 */
		if (refclk < PLL_REFCLK_MIN) {
			panic();
		}

		mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_FRACIN_MASK);
		mmio_clrbits_32(pllxcfgr4, RCC_PLLxCFGR4_DSMEN);
		mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_DACEN);
		mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_SSCGDIS);
		mmio_setbits_32(pllxcfgr1, RCC_PLLxCFGR1_SSMODRST);
	} else {
		/* PLL in frac mode */

		/*
		 * No need to check max clock, as oscillator reference clocks
		 * will always be less than 1.2GHz
		 */
		if (refclk < PLL_FRAC_REFCLK_MIN) {
			panic();
		}

		mmio_clrsetbits_32(pllxcfgr3, RCC_PLLxCFGR3_FRACIN_MASK,
				   fracv & RCC_PLLxCFGR3_FRACIN_MASK);
		mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_SSCGDIS);
		mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_DSMEN);
	}

	assert(pllcfg[REFDIV] != 0U);

	mmio_clrsetbits_32(pllxcfgr2, RCC_PLLxCFGR2_FBDIV_MASK,
			   (pllcfg[FBDIV] << RCC_PLLxCFGR2_FBDIV_SHIFT) &
			   RCC_PLLxCFGR2_FBDIV_MASK);
	mmio_clrsetbits_32(pllxcfgr2, RCC_PLLxCFGR2_FREFDIV_MASK,
			   pllcfg[REFDIV] & RCC_PLLxCFGR2_FREFDIV_MASK);
	mmio_clrsetbits_32(pllxcfgr6, RCC_PLLxCFGR6_POSTDIV1_MASK,
			   pllcfg[POSTDIV1] & RCC_PLLxCFGR6_POSTDIV1_MASK);
	mmio_clrsetbits_32(pllxcfgr7, RCC_PLLxCFGR7_POSTDIV2_MASK,
			   pllcfg[POSTDIV2] & RCC_PLLxCFGR7_POSTDIV2_MASK);

	if ((pllcfg[POSTDIV1] == 0U) || (pllcfg[POSTDIV2] == 0U)) {
		/* Bypass mode */
		mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_BYPASS);
		mmio_clrbits_32(pllxcfgr4, RCC_PLLxCFGR4_FOUTPOSTDIVEN);
	} else {
		mmio_clrbits_32(pllxcfgr4, RCC_PLLxCFGR4_BYPASS);
		mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_FOUTPOSTDIVEN);
	}

	return 0;
}

static void clk_stm32_pll_config_csg(struct stm32_clk_priv *priv,
				     const struct stm32_clk_pll *pll,
				     uint32_t *csg)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uintptr_t pllxcfgr3 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR3;
	uintptr_t pllxcfgr4 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR4;
	uintptr_t pllxcfgr5 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR5;


	mmio_clrsetbits_32(pllxcfgr5, RCC_PLLxCFGR5_DIVVAL_MASK,
			   csg[DIVVAL] & RCC_PLLxCFGR5_DIVVAL_MASK);
	mmio_clrsetbits_32(pllxcfgr5, RCC_PLLxCFGR5_SPREAD_MASK,
			   (csg[SPREAD] << RCC_PLLxCFGR5_SPREAD_SHIFT) &
			   RCC_PLLxCFGR5_SPREAD_MASK);

	if (csg[DOWNSPREAD] != 0) {
		mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_DOWNSPREAD);
	} else {
		mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_DOWNSPREAD);
	}

	mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_SSCGDIS);

	mmio_clrbits_32(pllxcfgr1, RCC_PLLxCFGR1_PLLEN);
	udelay(1);

	mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_DSMEN);
	mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_DACEN);
}

static int stm32_clk_configure_mux(struct stm32_clk_priv *priv, uint32_t data);

static inline struct stm32_pll_dt_cfg *clk_stm32_pll_get_pdata(int pll_idx)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	struct stm32_clk_platdata *pdata = priv->pdata;

	return  &pdata->pll[pll_idx];
}

static int _clk_stm32_pll1_init(struct stm32_clk_priv *priv, int pll_idx,
				struct stm32_pll_dt_cfg *pll_conf)
{
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_idx);
	unsigned long refclk;
	int ret = 0;

	/*
	 * TODO: check if pll has already good parameters or if we could make
	    a configuration on the fly.
	 */

	stm32mp2_a35_ss_on_hsi();

	ret = stm32_clk_configure_mux(priv, pll_conf->src);
	if (ret != 0) {
		panic();
	}

	refclk = _clk_stm32_get_parent_rate(priv, pll->clk_id);

	/*
	 * No need to check max clock, as oscillator reference clocks will
	 * always be less than 1.2 GHz
	 */
	if (refclk < PLL_REFCLK_MIN) {
		EARLY_ERROR("%s: %d\n", __func__, __LINE__);
		panic();
	}

	stm32mp2_a35_pll1_config(pll_conf->cfg[FBDIV], pll_conf->cfg[REFDIV],
				 pll_conf->cfg[POSTDIV1], pll_conf->cfg[POSTDIV2]);

	ret = stm32mp2_a35_pll1_start();
	if (ret != 0) {
		panic();
	}

	return 0;
}

static int clk_stm32_pll_wait_mux_ready(struct stm32_clk_priv *priv,
					const struct stm32_clk_pll *pll)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uint64_t timeout = timeout_init_us(CLKSRC_TIMEOUT);

	while ((mmio_read_32(pllxcfgr1) & RCC_PLLxCFGR1_CKREFST) !=
	       RCC_PLLxCFGR1_CKREFST) {
		if (timeout_elapsed(timeout)) {
			EARLY_ERROR("PLL%d ref clock not started\n", pll->clk_id);
			return -ETIMEDOUT;
		}
	}

	return 0;
}

static int _clk_stm32_pll_init(struct stm32_clk_priv *priv, int pll_idx,
			       struct stm32_pll_dt_cfg *pll_conf)
{
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_idx);
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	bool spread_spectrum = false;
	int ret = 0;

