DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
	/*
	 * TODO: check if pll has already good parameters or if we could make
	    a configuration on the fly.
	 */

	_clk_stm32_pll_disable(priv, pll);

	ret = stm32_clk_configure_mux(priv, pll_conf->src);
	if (ret != 0) {
		panic();
	}

	ret = clk_stm32_pll_wait_mux_ready(priv, pll);
	if (ret != 0) {
		panic();
	}

	ret = clk_stm32_pll_config_output(priv, pll, pll_conf->cfg, pll_conf->frac);
	if (ret != 0) {
		panic();
	}

	if (pll_conf->csg_enabled) {
		clk_stm32_pll_config_csg(priv, pll, pll_conf->csg);
		spread_spectrum = true;
	}

	_clk_stm32_pll_enable(priv, pll);

	if (spread_spectrum) {
		mmio_clrbits_32(pllxcfgr1, RCC_PLLxCFGR1_SSMODRST);
	}

	return 0;
}

static int clk_stm32_pll_init(struct stm32_clk_priv *priv, int pll_idx)
{
	struct stm32_pll_dt_cfg *pll_conf = clk_stm32_pll_get_pdata(pll_idx);

	if (pll_conf->enabled) {
		if (pll_idx == _PLL1) {
			return _clk_stm32_pll1_init(priv, pll_idx, pll_conf);
		} else  {
			return _clk_stm32_pll_init(priv, pll_idx, pll_conf);
		}
	}

	return 0;
}

static int stm32mp2_clk_pll_configure(struct stm32_clk_priv *priv)
{
#if !STM32MP_M33_TDCID
	enum pll_id i;
	int err;

	for (i = _PLL1; i < _PLL_NB; i++) {
		err = clk_stm32_pll_init(priv, i);
		if (err) {
			return err;
		}
	}

	return 0;
#else
	return clk_stm32_pll_init(priv, _PLL1);
#endif
}

static int wait_predivsr(uint16_t channel)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	uintptr_t rcc_base = priv->base;
	uintptr_t previvsr;
	uint32_t channel_bit;
	uint64_t timeout;

	if (channel < __WORD_BIT) {
		previvsr = rcc_base + RCC_PREDIVSR1;
		channel_bit = BIT(channel);
	} else {
		previvsr = rcc_base + RCC_PREDIVSR2;
		channel_bit = BIT(channel - __WORD_BIT);
	}

	timeout = timeout_init_us(CLKDIV_TIMEOUT);
	while ((mmio_read_32(previvsr) & channel_bit) != 0U) {
		if (timeout_elapsed(timeout)) {
			EARLY_ERROR("Pre divider status: %x\n",
			      mmio_read_32(previvsr));
			return -ETIMEDOUT;
		}
	}

	return 0;
}

static int wait_findivsr(uint16_t channel)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	uintptr_t rcc_base = priv->base;
	uintptr_t finvivsr;
	uint32_t channel_bit;
	uint64_t timeout;

	if (channel < __WORD_BIT) {
		finvivsr = rcc_base + RCC_FINDIVSR1;
		channel_bit = BIT(channel);
	} else {
		finvivsr = rcc_base + RCC_FINDIVSR2;
		channel_bit = BIT(channel - __WORD_BIT);
	}

	timeout = timeout_init_us(CLKDIV_TIMEOUT);
	while ((mmio_read_32(finvivsr) & channel_bit) != 0U) {
		if (timeout_elapsed(timeout)) {
			EARLY_ERROR("Final divider status: %x\n",
			      mmio_read_32(finvivsr));
			return -ETIMEDOUT;
		}
	}

	return 0;
}

static int wait_xbar_sts(uint16_t channel)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	uintptr_t rcc_base = priv->base;
	uintptr_t xbar_cfgr = rcc_base + RCC_XBAR0CFGR + (0x4U * channel);
	uint64_t timeout;

	timeout = timeout_init_us(CLKDIV_TIMEOUT);
	while ((mmio_read_32(xbar_cfgr) & RCC_XBAR0CFGR_XBAR0STS) != 0U) {
		if (timeout_elapsed(timeout)) {
			EARLY_ERROR("XBAR%uCFGR: %x\n", channel,
			      mmio_read_32(xbar_cfgr));
			return -ETIMEDOUT;
		}
	}

	return 0;
}

static void flexclkgen_config_channel(uint16_t channel, unsigned int clk_src,
				      unsigned int prediv, unsigned int findiv)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	uintptr_t rcc_base = priv->base;

	if (wait_predivsr(channel) != 0) {
		panic();
	}

	mmio_clrsetbits_32(rcc_base + RCC_PREDIV0CFGR + (0x4U * channel),
			   RCC_PREDIV0CFGR_PREDIV0_MASK,
			   prediv);

	if (wait_predivsr(channel) != 0) {
		panic();
	}

	if (wait_findivsr(channel) != 0) {
		panic();
	}

	mmio_clrsetbits_32(rcc_base + RCC_FINDIV0CFGR + (0x4U * channel),
			   RCC_FINDIV0CFGR_FINDIV0_MASK,
			   findiv);

	if (wait_findivsr(channel) != 0) {
		panic();
	}

	if (wait_xbar_sts(channel) != 0) {
		panic();
	}

	mmio_clrsetbits_32(rcc_base + RCC_XBAR0CFGR + (0x4U * channel),
			   RCC_XBARxCFGR_XBARxSEL_MASK,
			   clk_src);
	mmio_setbits_32(rcc_base + RCC_XBAR0CFGR + (0x4U * channel),
			RCC_XBARxCFGR_XBARxEN);

	if (wait_xbar_sts(channel) != 0) {
		panic();
	}
}

static int stm32mp2_clk_flexgen_configure(struct stm32_clk_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	uint32_t i;

	for (i = 0U; i < pdata->nflexgen; i++) {
		uint32_t val = pdata->flexgen[i];
		uint32_t cmd, cmd_data;
		unsigned int channel, clk_src, pdiv, fdiv;

		cmd = (val & CMD_MASK) >> CMD_SHIFT;
		cmd_data = val & ~CMD_MASK;

		if (cmd != CMD_FLEXGEN) {
			continue;
		}

		channel = (cmd_data & FLEX_ID_MASK) >> FLEX_ID_SHIFT;
		clk_src = (cmd_data & FLEX_SEL_MASK) >> FLEX_SEL_SHIFT;
		pdiv = (cmd_data & FLEX_PDIV_MASK) >> FLEX_PDIV_SHIFT;
		fdiv = (cmd_data & FLEX_FDIV_MASK) >> FLEX_FDIV_SHIFT;

		/* TODO: check if channel can be reconfigured */
		switch (channel) {
		case 33U: /* STGEN */
			break;

		default:
			flexclkgen_config_channel(channel, clk_src, pdiv, fdiv);
			break;
		}
	}

	return 0;
}

#if !STM32MP_M33_TDCID
static void stm32_enable_oscillator_hse(struct stm32_clk_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_HSE];
	bool digbyp =  osci->digbyp;
	bool bypass = osci->bypass;
	bool css = osci->css;

	if (_clk_stm32_get_rate(priv, _CK_HSE) == 0U) {
		return;
	}

	clk_oscillator_set_bypass(priv, _CK_HSE, digbyp, bypass);

	_clk_stm32_enable(priv, _CK_HSE);

	clk_oscillator_set_css(priv, _CK_HSE, css);
}

static void stm32_enable_oscillator_lse(struct stm32_clk_priv *priv)
{
	struct clk_oscillator_data *osc_data = clk_oscillator_get_data(priv, _CK_LSE);
	struct stm32_clk_platdata *pdata = priv->pdata;
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_LSE];
	bool digbyp =  osci->digbyp;
	bool bypass = osci->bypass;
	uint8_t drive = osci->drive;

	if (_clk_stm32_get_rate(priv, _CK_LSE) == 0U) {
		return;
	}

	/* Do not reconfigure LSE if already enabled */
	if (_clk_stm32_gate_is_enabled(priv, osc_data->gate_id)) {
		return;
	}

	clk_oscillator_set_bypass(priv, _CK_LSE, digbyp, bypass);

	clk_oscillator_set_drive(priv, _CK_LSE, drive);

	_clk_stm32_gate_enable(priv, osc_data->gate_id);
}
#endif

