DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
static int stm32mp2_clk_switch_to_hsi(struct stm32_clk_priv *priv)
{
	stm32mp2_a35_ss_on_hsi();
	stm32mp2_clk_muxsel_on_hsi(priv);
#if !STM32MP_M33_TDCID
	stm32mp2_clk_xbar_on_hsi(priv);
#endif

	return 0;
}

#if !STM32MP_M33_TDCID
static int stm32_clk_oscillators_wait_lse_ready(struct stm32_clk_priv *priv)
{
	int ret = 0;

	if (_clk_stm32_get_rate(priv, _CK_LSE) != 0U) {
		ret = clk_oscillator_wait_ready_on(priv, _CK_LSE);
	}

	return ret;
}

static void stm32_enable_oscillator_msi(struct stm32_clk_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	struct stm32_osci_dt_cfg *osci = &pdata->osci[OSC_MSI];
	int err;

	err = clk_stm32_osc_msi_set_rate(priv, _CK_MSI, osci->freq, 0);
	if (err != 0) {
		EARLY_ERROR("Invalid rate %lu MHz for MSI ! (4 or 16 only)\n",
			    osci->freq / 1000000U);
		panic();
	}

	_clk_stm32_enable(priv, _CK_MSI);
}

static void stm32_clk_oscillators_enable(struct stm32_clk_priv *priv)
{
	stm32_enable_oscillator_hse(priv);
	stm32_enable_oscillator_lse(priv);
	stm32_enable_oscillator_msi(priv);
	_clk_stm32_enable(priv, _CK_LSI);
}
#endif

static int stm32_clk_configure_div(struct stm32_clk_priv *priv, uint32_t data)
{
	int div_id = (data & DIV_ID_MASK) >> DIV_ID_SHIFT;
	int div_n = (data & DIV_DIVN_MASK) >> DIV_DIVN_SHIFT;

	return clk_stm32_set_div(priv, div_id, div_n);
}

static int stm32_clk_configure_mux(struct stm32_clk_priv *priv, uint32_t data)
{
	int mux_id = (data & MUX_ID_MASK) >> MUX_ID_SHIFT;
	int sel = (data & MUX_SEL_MASK) >> MUX_SEL_SHIFT;

	return clk_mux_set_parent(priv, mux_id, sel);
}

static int stm32_clk_configure_clk_get_binding_id(struct stm32_clk_priv *priv, uint32_t data)
{
	unsigned long binding_id = ((unsigned long)data & CLK_ID_MASK) >> CLK_ID_SHIFT;

	return clk_get_index(priv, binding_id);
}

static int stm32_clk_configure_clk(struct stm32_clk_priv *priv, uint32_t data)
{
	int sel = (data & CLK_SEL_MASK) >> CLK_SEL_SHIFT;
	int enable = (data & CLK_ON_MASK) >> CLK_ON_SHIFT;
	int clk_id = 0;
	int ret = 0;

	clk_id = stm32_clk_configure_clk_get_binding_id(priv, data);
	if (clk_id < 0) {
		return clk_id;
	}

	if (sel != CLK_NOMUX) {
		ret = _clk_stm32_set_parent_by_index(priv, clk_id, sel);
		if (ret != 0) {
			return ret;
		}
	}

	if (enable) {
		clk_stm32_enable_call_ops(priv, clk_id);
	} else {
		clk_stm32_disable_call_ops(priv, clk_id);
	}

	return 0;
}

static int stm32_clk_configure(struct stm32_clk_priv *priv, uint32_t val)
{
	uint32_t cmd = (val & CMD_MASK) >> CMD_SHIFT;
	uint32_t cmd_data = val & ~CMD_MASK;
	int ret = -1;

	switch (cmd) {
	case CMD_DIV:
		ret = stm32_clk_configure_div(priv, cmd_data);
		break;

	case CMD_MUX:
		ret = stm32_clk_configure_mux(priv, cmd_data);
		break;

	case CMD_CLK:
		ret = stm32_clk_configure_clk(priv, cmd_data);
		break;

	default:
		EARLY_ERROR("%s: cmd unknown ! : 0x%x\n", __func__, val);
		break;
	}

	return ret;
}

static int stm32_clk_bus_configure(struct stm32_clk_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	uint32_t i;

	for (i = 0; i < pdata->nbusclk; i++) {
		int ret;

		ret = stm32_clk_configure(priv, pdata->busclk[i]);
		if (ret != 0) {
			return ret;
		}
	}

	return 0;
}

static int stm32_clk_kernel_configure(struct stm32_clk_priv *priv)
{
	struct stm32_clk_platdata *pdata = priv->pdata;
	uint32_t i;

	for (i = 0U; i < pdata->nkernelclk; i++) {
		int ret;

		ret = stm32_clk_configure(priv, pdata->kernelclk[i]);
		if (ret != 0) {
			return ret;
		}
	}

	return 0;
}

static int stm32mp2_init_clock_tree(void)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	int ret;

	/* Set timer with STGEN without changing its clock source */
	stm32mp_stgen_restore_rate();
	generic_delay_timer_init();

#if !STM32MP_M33_TDCID
	stm32_clk_oscillators_enable(priv);
#endif

	/* Come back to HSI */
	ret = stm32mp2_clk_switch_to_hsi(priv);
	if (ret != 0) {
		panic();
	}

	ret = stm32mp2_clk_pll_configure(priv);
	if (ret != 0) {
		panic();
	}

#if !STM32MP_M33_TDCID
	/* Wait LSE ready before to use it */
	ret = stm32_clk_oscillators_wait_lse_ready(priv);
	if (ret != 0) {
		panic();
	}
#endif

	ret = stm32mp2_clk_flexgen_configure(priv);
	if (ret != 0) {
		panic();
	}

	ret = stm32_clk_bus_configure(priv);
	if (ret != 0) {
		panic();
	}

	ret = stm32_clk_kernel_configure(priv);
	if (ret != 0) {
		panic();
	}

	return 0;
}

static int clk_stm32_parse_oscillator_fdt(void *fdt, int node, const char *name,
					  struct stm32_osci_dt_cfg *osci)
{
	int subnode = 0;

	/* Default value oscillator not found, freq=0 */
	osci->freq = 0;

	fdt_for_each_subnode(subnode, fdt, node) {
		const char *cchar = NULL;
		const fdt32_t *cuint = NULL;
		int ret = 0;

		cchar = fdt_get_name(fdt, subnode, &ret);
		if (cchar == NULL) {
			return ret;
		}

		if (strncmp(cchar, name, (size_t)ret) ||
		    fdt_get_status(subnode) == DT_DISABLED) {
			continue;
		}

		cuint = fdt_getprop(fdt, subnode, "clock-frequency", &ret);
		if (cuint == NULL) {
			return ret;
		}

		osci->freq = fdt32_to_cpu(*cuint);

		if (fdt_getprop(fdt, subnode, "st,bypass", NULL) != NULL) {
			osci->bypass = true;
		}

		if (fdt_getprop(fdt, subnode, "st,digbypass", NULL) != NULL) {
			osci->digbyp = true;
		}

		if (fdt_getprop(fdt, subnode, "st,css", NULL) != NULL) {
			osci->css = true;
		}

		osci->drive = fdt_read_uint32_default(fdt, subnode, "st,drive", LSEDRV_MEDIUM_HIGH);

		return 0;
	}

	return 0;
}

static int stm32_clk_parse_fdt_all_oscillator(void *fdt, struct stm32_clk_platdata *pdata)
{
	int fdt_err = 0;
	uint32_t i = 0;
	int node = 0;

	node = fdt_path_offset(fdt, "/clocks");
	if (node < 0) {
		return -FDT_ERR_NOTFOUND;
	}

	for (i = 0; i < pdata->nosci; i++) {
		const char *name = NULL;

		name = clk_stm32_get_oscillator_name((enum stm32_osc)i);
		if (name == NULL) {
			continue;
		}

		fdt_err = clk_stm32_parse_oscillator_fdt(fdt, node, name, &pdata->osci[i]);
		if (fdt_err < 0) {
			panic();
		}
	}

	return 0;
}

static int clk_stm32_parse_pll_fdt(void *fdt, int subnode, struct stm32_pll_dt_cfg *pll)
{
	const fdt32_t *cuint = NULL;
	int subnode_pll = 0;
	uint32_t val = 0;
	int err = 0;

	cuint = fdt_getprop(fdt, subnode, "st,pll", NULL);
	if (!cuint) {
		return -FDT_ERR_NOTFOUND;
	}

