DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/clk/clk-stm32mp2.c
	subnode_pll = fdt_node_offset_by_phandle(fdt, fdt32_to_cpu(*cuint));
	if (subnode_pll < 0) {
		return -FDT_ERR_NOTFOUND;
	}

	err = fdt_read_uint32_array(fdt, subnode_pll, "cfg", (int)PLLCFG_NB, pll->cfg);
	if (err != 0) {
		return err;
	}

	err = fdt_read_uint32_array(fdt, subnode_pll, "csg", (int)PLLCSG_NB, pll->csg);

	pll->csg_enabled = (err == 0);

	if (err == -FDT_ERR_NOTFOUND) {
		err = 0;
	}

	if (err != 0) {
		return err;
	}

	pll->enabled = true;

	pll->frac = fdt_read_uint32_default(fdt, subnode_pll, "frac", 0);

	pll->src = UINT32_MAX;

	err = fdt_read_uint32(fdt, subnode_pll, "src", &val);
	if  (err == 0) {
		pll->src = val;
	}

	return 0;
}

#define RCC_PLL_NAME_SIZE 12

static int stm32_clk_parse_fdt_all_pll(void *fdt, int node, struct stm32_clk_platdata *pdata)
{
	unsigned int i = 0;

	for (i = _PLL1; i < pdata->npll; i++) {
		struct stm32_pll_dt_cfg *pll = pdata->pll + i;
		char name[RCC_PLL_NAME_SIZE];
		int subnode = 0;
		int err = 0;

		snprintf(name, sizeof(name), "st,pll-%u", i + 1);

		subnode = fdt_subnode_offset(fdt, node, name);
		if (!fdt_check_node(subnode)) {
			continue;
		}

		err = clk_stm32_parse_pll_fdt(fdt, subnode, pll);
		if (err != 0) {
			panic();
		}
	}

	return 0;
}

static int stm32_clk_parse_fdt(struct stm32_clk_platdata *pdata)
{
	void *fdt = NULL;
	int node;
	int err;

	if (fdt_get_address(&fdt) == 0) {
		return -ENOENT;
	}

	node = fdt_node_offset_by_compatible(fdt, -1, DT_RCC_CLK_COMPAT);
	if (node < 0) {
		panic();
	}

	err = stm32_clk_parse_fdt_all_oscillator(fdt, pdata);
	if (err != 0) {
		return err;
	}

	err = stm32_clk_parse_fdt_all_pll(fdt, node, pdata);
	if (err != 0) {
		return err;
	}

	err = stm32_clk_parse_fdt_by_name(fdt, node, "st,busclk", pdata->busclk, &pdata->nbusclk);
	if (err != 0) {
		return err;
	}

	err = stm32_clk_parse_fdt_by_name(fdt, node, "st,flexgen", pdata->flexgen,
					  &pdata->nflexgen);
	if (err != 0) {
		return err;
	}

	err = stm32_clk_parse_fdt_by_name(fdt, node, "st,kerclk", pdata->kernelclk,
					  &pdata->nkernelclk);
	if (err != 0) {
		return err;
	}

	return 0;
}
#endif /* IMAGE_BL2 */

static struct stm32_osci_dt_cfg mp25_osci[NB_OSCILLATOR];

static struct stm32_pll_dt_cfg mp25_pll[_PLL_NB];

#define DT_FLEXGEN_CLK_MAX	64
static uint32_t mp25_flexgen[DT_FLEXGEN_CLK_MAX];

#define DT_BUS_CLK_MAX		6
static uint32_t mp25_busclk[DT_BUS_CLK_MAX];

#define DT_KERNEL_CLK_MAX	20
static uint32_t mp25_kernelclk[DT_KERNEL_CLK_MAX];

static struct stm32_clk_platdata stm32mp25_pdata = {
	.osci = mp25_osci,
	.nosci = NB_OSCILLATOR,
	.pll = mp25_pll,
	.npll = _PLL_NB,
	.flexgen = mp25_flexgen,
	.nflexgen = DT_FLEXGEN_CLK_MAX,
	.busclk	= mp25_busclk,
	.nbusclk = DT_BUS_CLK_MAX,
	.kernelclk = mp25_kernelclk,
	.nkernelclk = DT_KERNEL_CLK_MAX,
};

static uint8_t refcounts_mp25[CK_LAST];

static struct stm32_clk_priv stm32mp25_clock_data = {
	.base		= RCC_BASE,
	.num		= ARRAY_SIZE(stm32mp25_clk),
	.clks		= stm32mp25_clk,
	.parents	= parent_mp25,
	.nb_parents	= ARRAY_SIZE(parent_mp25),
	.gates		= gates_mp25,
	.nb_gates	= ARRAY_SIZE(gates_mp25),
	.div		= dividers_mp25,
	.nb_div		= ARRAY_SIZE(dividers_mp25),
	.osci_data	= stm32mp25_osc_data,
	.nb_osci_data	= ARRAY_SIZE(stm32mp25_osc_data),
	.gate_refcounts	= refcounts_mp25,
	.pdata		= &stm32mp25_pdata,
	.ops_array	= ops_array_mp25,
};

int stm32mp2_clk_init(void)
{
	uintptr_t base = RCC_BASE;
	int ret;

#ifdef IMAGE_BL2
	ret = stm32_clk_parse_fdt(&stm32mp25_pdata);
	if (ret != 0) {
		return ret;
	}
#endif

	ret = clk_stm32_init(&stm32mp25_clock_data, base);
	if (ret != 0) {
		return ret;
	}

#ifdef IMAGE_BL2
	ret = stm32mp2_init_clock_tree();
	if (ret != 0) {
		return ret;
	}

	clk_stm32_enable_critical_clocks();
#endif

	return 0;
}

int stm32mp2_pll1_disable(void)
{
#ifdef IMAGE_BL2
	return -EPERM;
#else
	uintptr_t a35_ss_address = A35SSC_BASE;
	uintptr_t pll_enable_reg = a35_ss_address + A35_SS_PLL_ENABLE;

	stm32mp2_a35_ss_on_hsi();

	mmio_clrbits_32(pll_enable_reg, A35_SS_PLL_ENABLE_PD);

	return 0;
#endif
}
